[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=64
subdivisions=8
width=1024
height=256
channels=3

#letter_box=1
#mixup=1

momentum=0.9 #09
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
burn_in=1000
max_batches = 30020
policy=steps
steps=10000,17000,25000
scales=.1,.1,.1


#0
#pre-resize:conv 3 128 7*7 2
#downsample=512*128
[convolutional]
batch_normalize=1
filters=32 #128
size=7
stride=2
pad=3 #pad=(k-1)/2=(7-1)/2=3
activation=relu

#1
#pre-resize:resudual-1  conv 128 256 3*3 2
#downsample=256*64
[convolutional]
batch_normalize=1
filters=64 #256
size=3
stride=2
pad=1
activation=relu

#2
#pre-resize:resudual-2  conv 256 256 3*3 1
[convolutional]
batch_normalize=1
filters=64 #256
size=3
stride=1
pad=1
activation=relu

#3
#pre-resize:resudual-2  shortcut
[shortcut]
from=-2
activation=relu

#4
#downsample=128*32
[convolutional]
batch_normalize=1
filters=64 #256
size=3
stride=2
pad=1
activation=relu

#5
#pre-resize:resudual-2  conv 256 256 3*3 1
[convolutional]
batch_normalize=1
filters=64 #256
size=3
stride=1
pad=1
activation=relu

#6
#pre-resize:resudual-2  shortcut
[shortcut]
from=-2
activation=relu

#----------------------------------------------
#hourglass-module-1
#7
#layer1-up1
#fire_module_1-no residual
#conv1
[convolutional]
batch_normalize=1
filters=32 #128
size=1
stride=1
pad=1
activation=relu

#8
#conv_1*1
[convolutional]
batch_normalize=1
filters=32 #128
size=1
stride=1
pad=1
activation=relu

#9
[route]
layers=-2

#10
#conv_3*3
[convolutional]
batch_normalize=1
groups=32 #128
filters=32 #128
size=3
stride=1
pad=1
activation=relu

#11
[route]
layers=-1,-3

#12
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=32 #128
size=1
stride=1
pad=1
activation=relu

#13
#conv_1*1
[convolutional]
batch_normalize=1
filters=32 #128
size=1
stride=1
pad=1
activation=relu

#14
[route]
layers=-2

#15
#conv_3*3
[convolutional]
batch_normalize=1
groups=32 #128
filters=32 #128
size=3
stride=1
pad=1
activation=relu

#16
[route]
layers=-1,-3

#17
#layer1-low1
#fire_module_1-with residual
[route]
layers=-11

#18
#fire_module_1
#conv1
[convolutional]
batch_normalize=1
filters=32 #128
size=1
stride=1
pad=1
activation=relu

#19
#conv_1*1
[convolutional]
batch_normalize=1
filters=32 #128
size=1
stride=2
pad=1
activation=relu

#20
[route]
layers=-2

#21
#conv_3*3
[convolutional]
batch_normalize=1
groups=32 #128
filters=32 #128
size=3
stride=2
pad=1
activation=relu

#22
[route]
layers=-1,-3

#23
#shortcut
[shortcut]
from=-6
activation=relu

#24
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=32 #128
size=1
stride=1
pad=1
activation=relu

#25
#conv_1*1
[convolutional]
batch_normalize=1
filters=32 #128
size=1
stride=1
pad=1
activation=relu

#26
[route]
layers=-2

#27
#conv_3*3
[convolutional]
batch_normalize=1
groups=32 #128
filters=32 #128
size=3
stride=1
pad=1
activation=relu

#28
[route]
layers=-1,-3

#29
#layer1-low2-layer2-up1
#fire_module_1-no residual
#conv1
[convolutional]
batch_normalize=1
filters=32 #128
size=1
stride=1
pad=1
activation=relu

#30
#conv_1*1
[convolutional]
batch_normalize=1
filters=32 #128
size=1
stride=1
pad=1
activation=relu

#31
[route]
layers=-2

#32
#conv_3*3
[convolutional]
batch_normalize=1
groups=32 #128
filters=32 #128
size=3
stride=1
pad=1
activation=relu

#33
[route]
layers=-1,-3

#34
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=32 #128
size=1
stride=1
pad=1
activation=relu

#35
#conv_1*1
[convolutional]
batch_normalize=1
filters=32 #128
size=1
stride=1
pad=1
activation=relu

#36
[route]
layers=-2

#37
#conv_3*3
[convolutional]
batch_normalize=1
groups=32 #128
filters=32 #128
size=3
stride=1
pad=1
activation=relu

#38
[route]
layers=-1,-3

#39
#layer1-low2-layer2-low1
#fire_module_1
[route]
layers=-11

#40
#fire_module_1-with residual
#conv1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#41
#conv_1*1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=2
pad=1
activation=relu

#42
[route]
layers=-2

#43
#conv_3*3
[convolutional]
batch_normalize=1
groups=48 #192
filters=48 #192
size=3
stride=2
pad=1
activation=relu

#44
[route]
layers=-1,-3

#45
#shortcut
[shortcut]
from=-6
activation=relu

#46
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#47
#conv_1*1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#48
[route]
layers=-2

#49
#conv_3*3
[convolutional]
batch_normalize=1
groups=48 #192
filters=48 #192
size=3
stride=1
pad=1
activation=relu

#50
[route]
layers=-1,-3

#51
#layer1-low2-layer2-low2-layer3-up1
#fire_module_1-no residual
#conv1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#52
#conv_1*1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#53
[route]
layers=-2

#54
#conv_3*3
[convolutional]
batch_normalize=1
groups=48 #192
filters=48 #192
size=3
stride=1
pad=1
activation=relu

#55
[route]
layers=-1,-3

#56
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#57
#conv_1*1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#58
[route]
layers=-2

#59
#conv_3*3
[convolutional]
batch_normalize=1
groups=48 #192
filters=48 #192
size=3
stride=1
pad=1
activation=relu

#60
[route]
layers=-1,-3

#61
#layer3-low1
#fire_module_1
[route]
layers=-11

#62
#fire_module_1-with residual
#conv1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#63
#conv_1*1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=2
pad=1
activation=relu

#64
[route]
layers=-2

#65
#conv_3*3
[convolutional]
batch_normalize=1
groups=48 #192
filters=48 #192
size=3
stride=2
pad=1
activation=relu

#66
[route]
layers=-1,-3

#67
#shortcut
[shortcut]
from=-6
activation=relu

#68
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#69
#conv_1*1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#70
[route]
layers=-2

#71
#conv_3*3
[convolutional]
batch_normalize=1
groups=48 #192
filters=48 #192
size=3
stride=1
pad=1
activation=relu

#72
[route]
layers=-1,-3

#73
#layer1-low2-layer2-low2-layer3-low2-layer4-up1
#fire_module_1-no residual
#conv1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#74
#conv_1*1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#75
[route]
layers=-2

#76
#conv_3*3
[convolutional]
batch_normalize=1
groups=48 #192
filters=48 #192
size=3
stride=1
pad=1
activation=relu

#77
[route]
layers=-1,-3

#78
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#79
#conv_1*1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#80
[route]
layers=-2

#81
#conv_3*3
[convolutional]
batch_normalize=1
groups=48 #192
filters=48 #192
size=3
stride=1
pad=1
activation=relu

#82
[route]
layers=-1,-3

#83
#layer4-low1
#fire_module_1
[route]
layers=-11

#84
#fire_module_1-with residual
#conv1
[convolutional]
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=relu

#85
#conv_1*1
[convolutional]
batch_normalize=1
filters=64 #256
size=1
stride=2
pad=1
activation=relu

#86
[route]
layers=-2

#87
#conv_3*3
[convolutional]
batch_normalize=1
groups=64 #256
filters=64 #256
size=3
stride=2
pad=1
activation=relu

#88
[route]
layers=-1,-3

#89
#shortcut
[shortcut]
from=-6
activation=relu

#90
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=relu

#91
#conv_1*1
[convolutional]
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=relu

#92
[route]
layers=-2

#93
#conv_3*3
[convolutional]
batch_normalize=1
groups=64 #256
filters=64 #256
size=3
stride=1
pad=1
activation=relu

#94
[route]
layers=-1,-3

#95
#layer4-low2
#fire_module_1
[convolutional]
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=relu

#96
#conv_1*1
[convolutional]
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=relu

#97
[route]
layers=-2

#98
#conv_3*3
[convolutional]
batch_normalize=1
groups=64 #256
filters=64 #256
size=3
stride=1
pad=1
activation=relu

#99
[route]
layers=-1,-3

#100
#fire_module_2
[convolutional]
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=relu

#101
#conv_1*1
[convolutional]
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=relu

#102
[route]
layers=-2

#103
#conv_3*3
[convolutional]
batch_normalize=1
groups=64 #256
filters=64 #256
size=3
stride=1
pad=1
activation=relu

#104
[route]
layers=-1,-3

#105
#fire_module_3
[convolutional]
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=relu

#106
#conv_1*1
[convolutional]
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=relu

#107
[route]
layers=-2

#108
#conv_3*3
[convolutional]
batch_normalize=1
groups=64 #256
filters=64 #256
size=3
stride=1
pad=1
activation=relu

#109
[route]
layers=-1,-3

#110
#fire_module_4
[convolutional]
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=relu

#111
#conv_1*1
[convolutional]
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=relu

#112
[route]
layers=-2

#113
#conv_3*3
[convolutional]
batch_normalize=1
groups=64 #256
filters=64 #256
size=3
stride=1
pad=1
activation=relu

#114
[route]
layers=-1,-3

#115
#layer4-low3
#fire_moduel_1
[convolutional]
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=relu

#116
#conv_1*1
[convolutional]
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=relu

#117
[route]
layers=-2

#118
#conv_3*3
[convolutional]
batch_normalize=1
groups=64 #256
filters=64 #256
size=3
stride=1
pad=1
activation=relu

#119
[route]
layers=-1,-3

#120
#fire_moduel_2
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#121
#conv_1*1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#122
[route]
layers=-2

#123
#conv_3*3
[convolutional]
batch_normalize=1
groups=48 #192
filters=48 #192
size=3
stride=1
pad=1
activation=relu

#124
[route]
layers=-1,-3

#125
#layer4-up2
#w*h*c=w*2 * h*2 * c/4
[reorg3d]
stride=2
reverse=1

#126
#layer4-merge=up2+up1
[route]
layers=-1,82

#127
#layer3-low3
#fire_moduel_1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#128
#conv_1*1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#129
[route]
layers=-2

#130
#conv_3*3
[convolutional]
batch_normalize=1
groups=48 #192
filters=48 #192
size=3
stride=1
pad=1
activation=relu

#131
[route]
layers=-1,-3

#132
#fire_moduel_2
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#133
#conv_1*1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#134
[route]
layers=-2

#135
#conv_3*3
[convolutional]
batch_normalize=1
groups=48 #192
filters=48 #192
size=3
stride=1
pad=1
activation=relu

#136
[route]
layers=-1,-3

#137
#layer3-up2
[reorg3d]
stride=2
reverse=1

#138
#layer3-merge=up2+up1
[route]
layers=-1,60

#139
#layer2-low3
#fire_moduel_1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#140
#conv_1*1
[convolutional]
batch_normalize=1
filters=48 #192
size=1
stride=1
pad=1
activation=relu

#141
[route]
layers=-2

#142
#conv_3*3
[convolutional]
batch_normalize=1
groups=48 #192
filters=48 #192
size=3
stride=1
pad=1
activation=relu

#143
[route]
layers=-1,-3

#144
#fire_moduel_2
[convolutional]
batch_normalize=1
filters=32 #128
size=1
stride=1
pad=1
activation=relu

#145
#conv_1*1
[convolutional]
batch_normalize=1
filters=32 #128
size=1
stride=1
pad=1
activation=relu

#146
[route]
layers=-2

#147
#conv_3*3
[convolutional]
batch_normalize=1
groups=32 #128
filters=32 #128
size=3
stride=1
pad=1
activation=relu

#148
[route]
layers=-1,-3

#149
#layer2-up2
[reorg3d]
stride=2
reverse=1

#150
#layer2-merge=up2+up1
[route]
layers=-1,38

#151
#layer1-low3
#fire_moduel_1
[convolutional]
batch_normalize=1
filters=32 #128
size=1
stride=1
pad=1
activation=relu

#152
#conv_1*1
[convolutional]
batch_normalize=1
filters=32 #128
size=1
stride=1
pad=1
activation=relu

#153
[route]
layers=-2

#154
#conv_3*3
[convolutional]
batch_normalize=1
groups=32 #128
filters=32 #128
size=3
stride=1
pad=1
activation=relu

#155
[route]
layers=-1,-3

#156
#fire_moduel_2
[convolutional]
batch_normalize=1
filters=32 #128
size=1
stride=1
pad=1
activation=relu

#157
#conv_1*1
[convolutional]
batch_normalize=1
filters=32 #128
size=1
stride=1
pad=1
activation=relu

#158
[route]
layers=-2

#159
#conv_3*3
[convolutional]
batch_normalize=1
groups=32 #128
filters=32 #128
size=3
stride=1
pad=1
activation=relu

#160
[route]
layers=-1,-3

#161
#layer1-up2
[reorg3d]
stride=2
reverse=1

#162
#layer1-merge=up2+up1
[route]
layers=-1,16

###############cnvs1#####################
#163
[convolutional]
batch_normalize=1
filters=64 #256
size=3
stride=1
pad=1
activation=relu
#164
[convolutional]
batch_normalize=1
filters=64 #256
size=3
stride=1
pad=1
activation=relu

###############inters1#####################
#165
[convolutional]
batch_normalize=1
filters=64 #256
size=3
stride=1
pad=1
activation=relu
#166
[convolutional]
batch_normalize=1
filters=64 #256
size=3
stride=1
pad=1
activation=relu
#167
[shortcut]
from=-2
activation=relu

###############cnvs2#####################
#168
[convolutional]
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=relu

###############inters1#####################
#169
[convolutional]
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=relu

#####################################################

### TridentNet - large objects - Start
#1-170
[convolutional]
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=leaky
#2-171
[convolutional]
dilation=3
batch_normalize=1
filters=64 #256
size=3
stride=1
pad=1
activation=leaky
#3-172
[convolutional]
batch_normalize=1
filters=256 #1024
size=1
stride=1
pad=1
activation=linear
#4-173
[shortcut]
from=-4
activation=leaky
#5-174
[convolutional]
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=leaky
#6-175
[convolutional]
dilation=3
batch_normalize=1
filters=64 #256
size=3
stride=1
pad=1
activation=leaky
#7-176
[convolutional]
batch_normalize=1
filters=256 #1024
size=1
stride=1
pad=1
activation=linear
#8-177
[shortcut]
from=-4
activation=leaky
#9-178
[convolutional]
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=leaky
#10-179
[convolutional]
dilation=3
batch_normalize=1
filters=64 #256
size=3
stride=1
pad=1
activation=leaky
#11-180
[convolutional]
batch_normalize=1
filters=256 #1024
size=1
stride=1
pad=1
activation=linear
#181
[shortcut]
from=-4
activation=leaky

#182
## Conv 5
[convolutional]
batch_normalize=1
filters=128 #512
size=1
stride=1
pad=1
activation=leaky
#183
[convolutional]
dilation=3
batch_normalize=1
filters=128 #512
size=3
stride=2
pad=1
activation=leaky
#184
[convolutional]
batch_normalize=1
filters=512 #2048
size=1
stride=1
pad=1
activation=linear
#185
[shortcut]
from=-4
activation=leaky
#186
[convolutional]
batch_normalize=1
filters=128 #512
size=1
stride=1
pad=1
activation=leaky
#187
[convolutional]
dilation=3
batch_normalize=1
filters=128 #512
size=3
stride=1
pad=1
activation=leaky
#188
[convolutional]
batch_normalize=1
filters=512 #2048
size=1
stride=1
pad=1
activation=linear

#189
[shortcut]
from=-4
activation=leaky
#190
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

#191
[convolutional]
size=1
stride=1
pad=1
filters=32
activation=linear

#192
[yolo]
mask = 8,9,10,11
anchors = 21, 15,  37, 22,  21, 42,  57, 30,  40, 79,  72, 48, 106, 36, 123, 63,  76,123, 180, 82, 220,121, 316,143
classes=3
num=12
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=0

### TridentNet - large objects - End


### TridentNet - medium objects - Start
#191
[route]
layers = 169
#192
[convolutional]
share_index=170
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=171
dilation=2
batch_normalize=1
filters=64 #256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=172
batch_normalize=1
filters=256 #1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
share_index=174
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=175
dilation=2
batch_normalize=1
filters=64 #256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=176
batch_normalize=1
filters=256 #1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
share_index=178
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=179
dilation=2
batch_normalize=1
filters=64 #256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=180
batch_normalize=1
filters=256 #1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky


## Conv 5
[convolutional]
share_index=182
batch_normalize=1
filters=128 #512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=183
dilation=2
batch_normalize=1
filters=128 #512
size=3
stride=2
pad=1
activation=leaky

[convolutional]
share_index=184
batch_normalize=1
filters=512 #2048
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
share_index=186
batch_normalize=1
filters=128 #512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=187
dilation=2
batch_normalize=1
filters=128 #512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=188
batch_normalize=1
filters=512 #2048
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=256 #1024
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 18

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=256 #1024
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=32
activation=linear

[yolo]
mask = 4,5,6,7
anchors = 23, 16,  20, 42,  42, 23,  56, 38,  87, 30,  40, 79,  97, 53,  76,122, 150, 66, 191, 96, 225,130, 319,141
classes=3
num=12
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=0

### TridentNet - medium objects - End


### TridentNet - small objects - Start

[route]
layers = 169

[convolutional]
share_index=170
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=171
dilation=1
batch_normalize=1
filters=64 #256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=172
batch_normalize=1
filters=256 #1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
share_index=174
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=175
dilation=1
batch_normalize=1
filters=64 #256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=176
batch_normalize=1
filters=256 #1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
share_index=178
batch_normalize=1
filters=64 #256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=179
dilation=1
batch_normalize=1
filters=64 #256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=180
batch_normalize=1
filters=256 #1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky


## Conv 5
[convolutional]
share_index=182
batch_normalize=1
filters=128 #512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=183
dilation=1
batch_normalize=1
filters=128 #512
size=3
stride=2
pad=1
activation=leaky

[convolutional]
share_index=184
batch_normalize=1
filters=512 #2048
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
share_index=186
batch_normalize=1
filters=128 #512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=187
dilation=1
batch_normalize=1
filters=128 #512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=188
batch_normalize=1
filters=512 #2048
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128 #512
activation=leaky

[upsample]
stride=4

[route]
layers = -1, 3

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=128 #512
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=32
activation=linear

[yolo]
mask = 0,1,2,3
anchors = 23, 16,  20, 42,  42, 23,  56, 38,  87, 30,  40, 79,  97, 53,  76,122, 150, 66, 191, 96, 225,130, 319,141
classes=3
num=12
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=0

### TridentNet - small objects - End
