[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=64
subdivisions=8
width=1024
height=256
channels=3
#letter_box=1

momentum=0.9 #09
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
burn_in=1000
max_batches = 10000
policy=steps
steps=7000,8000
scales=.1,.1


#0
#pre-resize:conv 3 128 7*7 2
#downsample=512*128
[convolutional]
batch_normalize=1
filters=128
size=7
stride=2
pad=3 #pad=(k-1)/2=(7-1)/2=3
activation=relu

#1
#pre-resize:resudual-1  conv 128 256 3*3 2
#downsample=256*64
[convolutional]
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=relu

#2
#pre-resize:resudual-2  conv 256 256 3*3 1
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

#3
#pre-resize:resudual-2  shortcut
[shortcut]
from=-2
activation=relu

#4
#downsample=128*32
[convolutional]
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=relu

#5
#pre-resize:resudual-2  conv 256 256 3*3 1
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

#6
#pre-resize:resudual-2  shortcut
[shortcut]
from=-2
activation=relu

#----------------------------------------------
#hourglass-module-1
#7
#layer1-up1
#fire_module_1-no residual
#conv1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#8
#conv_1*1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#9
[route]
layers=-2

#10
#conv_3*3
[convolutional]
batch_normalize=1
groups=128
filters=128
size=3
stride=1
pad=1
activation=relu

#11
[route]
layers=-1,-3

#12
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#13
#conv_1*1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#14
[route]
layers=-2

#15
#conv_3*3
[convolutional]
batch_normalize=1
groups=128
filters=128
size=3
stride=1
pad=1
activation=relu

#16
[route]
layers=-1,-3

#17
#layer1-low1
#fire_module_1-with residual
[route]
layers=-11

#18
#fire_module_1
#conv1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#19
#conv_1*1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=2
pad=1
activation=relu

#20
[route]
layers=-2

#21
#conv_3*3
[convolutional]
batch_normalize=1
groups=128
filters=128
size=3
stride=2
pad=1
activation=relu

#22
[route]
layers=-1,-3

#23
#shortcut
[shortcut]
from=-6
activation=relu

#24
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#25
#conv_1*1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#26
[route]
layers=-2

#27
#conv_3*3
[convolutional]
batch_normalize=1
groups=128
filters=128
size=3
stride=1
pad=1
activation=relu

#28
[route]
layers=-1,-3

#29
#layer1-low2-layer2-up1
#fire_module_1-no residual
#conv1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#30
#conv_1*1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#31
[route]
layers=-2

#32
#conv_3*3
[convolutional]
batch_normalize=1
groups=128
filters=128
size=3
stride=1
pad=1
activation=relu

#33
[route]
layers=-1,-3

#34
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#35
#conv_1*1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#36
[route]
layers=-2

#37
#conv_3*3
[convolutional]
batch_normalize=1
groups=128
filters=128
size=3
stride=1
pad=1
activation=relu

#38
[route]
layers=-1,-3

#39
#layer1-low2-layer2-low1
#fire_module_1
[route]
layers=-11

#40
#fire_module_1-with residual
#conv1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#41
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=2
pad=1
activation=relu

#42
[route]
layers=-2

#43
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=2
pad=1
activation=relu

#44
[route]
layers=-1,-3

#45
#shortcut
[shortcut]
from=-6
activation=relu

#46
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#47
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#48
[route]
layers=-2

#49
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=1
pad=1
activation=relu

#50
[route]
layers=-1,-3

#51
#layer1-low2-layer2-low2-layer3-up1
#fire_module_1-no residual
#conv1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#52
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#53
[route]
layers=-2

#54
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=1
pad=1
activation=relu

#55
[route]
layers=-1,-3

#56
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#57
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#58
[route]
layers=-2

#59
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=1
pad=1
activation=relu

#60
[route]
layers=-1,-3

#61
#layer3-low1
#fire_module_1
[route]
layers=-11

#62
#fire_module_1-with residual
#conv1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#63
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=2
pad=1
activation=relu

#64
[route]
layers=-2

#65
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=2
pad=1
activation=relu

#66
[route]
layers=-1,-3

#67
#shortcut
[shortcut]
from=-6
activation=relu

#68
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#69
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#70
[route]
layers=-2

#71
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=1
pad=1
activation=relu

#72
[route]
layers=-1,-3

#73
#layer1-low2-layer2-low2-layer3-low2-layer4-up1
#fire_module_1-no residual
#conv1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#74
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#75
[route]
layers=-2

#76
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=1
pad=1
activation=relu

#77
[route]
layers=-1,-3

#78
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#79
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#80
[route]
layers=-2

#81
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=1
pad=1
activation=relu

#82
[route]
layers=-1,-3

#83
#layer4-low1
#fire_module_1
[route]
layers=-11

#84
#fire_module_1-with residual
#conv1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#85
#conv_1*1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=2
pad=1
activation=relu

#86
[route]
layers=-2

#87
#conv_3*3
[convolutional]
batch_normalize=1
groups=256
filters=256
size=3
stride=2
pad=1
activation=relu

#88
[route]
layers=-1,-3

#89
#shortcut
[shortcut]
from=-6
activation=relu

#90
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#91
#conv_1*1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#92
[route]
layers=-2

#93
#conv_3*3
[convolutional]
batch_normalize=1
groups=256
filters=256
size=3
stride=1
pad=1
activation=relu

#94
[route]
layers=-1,-3

#95
#layer4-low2
#fire_module_1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#96
#conv_1*1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#97
[route]
layers=-2

#98
#conv_3*3
[convolutional]
batch_normalize=1
groups=256
filters=256
size=3
stride=1
pad=1
activation=relu

#99
[route]
layers=-1,-3

#100
#fire_module_2
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#101
#conv_1*1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#102
[route]
layers=-2

#103
#conv_3*3
[convolutional]
batch_normalize=1
groups=256
filters=256
size=3
stride=1
pad=1
activation=relu

#104
[route]
layers=-1,-3

#105
#fire_module_3
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#106
#conv_1*1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#107
[route]
layers=-2

#108
#conv_3*3
[convolutional]
batch_normalize=1
groups=256
filters=256
size=3
stride=1
pad=1
activation=relu

#109
[route]
layers=-1,-3

#110
#fire_module_4
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#111
#conv_1*1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#112
[route]
layers=-2

#113
#conv_3*3
[convolutional]
batch_normalize=1
groups=256
filters=256
size=3
stride=1
pad=1
activation=relu

#114
[route]
layers=-1,-3

#115
#layer4-low3
#fire_moduel_1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#116
#conv_1*1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#117
[route]
layers=-2

#118
#conv_3*3
[convolutional]
batch_normalize=1
groups=256
filters=256
size=3
stride=1
pad=1
activation=relu

#119
[route]
layers=-1,-3

#120
#fire_moduel_2
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#121
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#122
[route]
layers=-2

#123
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=1
pad=1
activation=relu

#124
[route]
layers=-1,-3

#125
#layer4-up2
#w*h*c=w*2 * h*2 * c/4
[reorg3d]
stride=2
reverse=1

#126
#layer4-merge=up2+up1
[route]
layers=-1,82

#127
#layer3-low3
#fire_moduel_1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#128
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#129
[route]
layers=-2

#130
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=1
pad=1
activation=relu

#131
[route]
layers=-1,-3

#132
#fire_moduel_2
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#133
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#134
[route]
layers=-2

#135
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=1
pad=1
activation=relu

#136
[route]
layers=-1,-3

#137
#layer3-up2
[reorg3d]
stride=2
reverse=1

#138
#layer3-merge=up2+up1
[route]
layers=-1,60

#139
#layer2-low3
#fire_moduel_1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#140
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#141
[route]
layers=-2

#142
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=1
pad=1
activation=relu

#143
[route]
layers=-1,-3

#144
#fire_moduel_2
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#145
#conv_1*1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#146
[route]
layers=-2

#147
#conv_3*3
[convolutional]
batch_normalize=1
groups=128
filters=128
size=3
stride=1
pad=1
activation=relu

#148
[route]
layers=-1,-3

#149
#layer2-up2
[reorg3d]
stride=2
reverse=1

#150
#layer2-merge=up2+up1
[route]
layers=-1,38

#151
#layer1-low3
#fire_moduel_1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#152
#conv_1*1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#153
[route]
layers=-2

#154
#conv_3*3
[convolutional]
batch_normalize=1
groups=128
filters=128
size=3
stride=1
pad=1
activation=relu

#155
[route]
layers=-1,-3

#156
#fire_moduel_2
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#157
#conv_1*1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#158
[route]
layers=-2

#159
#conv_3*3
[convolutional]
batch_normalize=1
groups=128
filters=128
size=3
stride=1
pad=1
activation=relu

#160
[route]
layers=-1,-3

#161
#layer1-up2
[reorg3d]
stride=2
reverse=1

#162
#layer1-merge=up2+up1
[route]
layers=-1,16

#hourglass-2-module
##############################################################
#163
#layer1-up1
#fire_module_1-no residual
#conv1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#164
#conv_1*1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#165
[route]
layers=-2

#166
#conv_3*3
[convolutional]
batch_normalize=1
groups=128
filters=128
size=3
stride=1
pad=1
activation=relu

#167
[route]
layers=-1,-3

#168
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#169
#conv_1*1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#170
[route]
layers=-2

#171
#conv_3*3
[convolutional]
batch_normalize=1
groups=128
filters=128
size=3
stride=1
pad=1
activation=relu

#172
[route]
layers=-1,-3

#173
#layer1-low1
#fire_module_1-with residual
[route]
layers=-11

#174
#fire_module_1
#conv1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#175
#conv_1*1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=2
pad=1
activation=relu

#176
[route]
layers=-2

#177
#conv_3*3
[convolutional]
batch_normalize=1
groups=128
filters=128
size=3
stride=2
pad=1
activation=relu

#178
[route]
layers=-1,-3

#179
#shortcut
[shortcut]
from=-6
activation=relu

#180
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#181
#conv_1*1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#182
[route]
layers=-2

#183
#conv_3*3
[convolutional]
batch_normalize=1
groups=128
filters=128
size=3
stride=1
pad=1
activation=relu

#184
[route]
layers=-1,-3

#185
#layer1-low2-layer2-up1
#fire_module_1-no residual
#conv1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#186
#conv_1*1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#187
[route]
layers=-2

#188
#conv_3*3
[convolutional]
batch_normalize=1
groups=128
filters=128
size=3
stride=1
pad=1
activation=relu

#189
[route]
layers=-1,-3

#190
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#191
#conv_1*1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#192
[route]
layers=-2

#193
#conv_3*3
[convolutional]
batch_normalize=1
groups=128
filters=128
size=3
stride=1
pad=1
activation=relu

#194
[route]
layers=-1,-3

#195
#layer1-low2-layer2-low1
#fire_module_1
[route]
layers=-11

#196
#fire_module_1-with residual
#conv1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#197
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=2
pad=1
activation=relu

#198
[route]
layers=-2

#199
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=2
pad=1
activation=relu

#200
[route]
layers=-1,-3

#201
#shortcut
[shortcut]
from=-6
activation=relu

#202
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#203
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#204
[route]
layers=-2

#205
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=1
pad=1
activation=relu

#206
[route]
layers=-1,-3

#207
#layer1-low2-layer2-low2-layer3-up1
#fire_module_1-no residual
#conv1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#208
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#209
[route]
layers=-2

#210
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=1
pad=1
activation=relu

#211
[route]
layers=-1,-3

#212
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#213
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#214
[route]
layers=-2

#215
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=1
pad=1
activation=relu

#216
[route]
layers=-1,-3

#217
#layer3-low1
#fire_module_1
[route]
layers=-11

#218
#fire_module_1-with residual
#conv1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#219
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=2
pad=1
activation=relu

#220
[route]
layers=-2

#221
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=2
pad=1
activation=relu

#222
[route]
layers=-1,-3

#223
#shortcut
[shortcut]
from=-6
activation=relu

#224
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#225
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#226
[route]
layers=-2

#227
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=1
pad=1
activation=relu

#228
[route]
layers=-1,-3

#229
#layer1-low2-layer2-low2-layer3-low2-layer4-up1
#fire_module_1-no residual
#conv1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#230
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#231
[route]
layers=-2

#232
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=1
pad=1
activation=relu

#233
[route]
layers=-1,-3

#234
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#235
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#236
[route]
layers=-2

#237
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=1
pad=1
activation=relu

#238
[route]
layers=-1,-3

#239
#layer4-low1
#fire_module_1
[route]
layers=-11

#240
#fire_module_1-with residual
#conv1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#241
#conv_1*1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=2
pad=1
activation=relu

#242
[route]
layers=-2

#243
#conv_3*3
[convolutional]
batch_normalize=1
groups=256
filters=256
size=3
stride=2
pad=1
activation=relu

#244
[route]
layers=-1,-3

#245
#shortcut
[shortcut]
from=-6
activation=relu

#246
#fire_module_2-no residual
#conv1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#247
#conv_1*1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#248
[route]
layers=-2

#249
#conv_3*3
[convolutional]
batch_normalize=1
groups=256
filters=256
size=3
stride=1
pad=1
activation=relu

#250
[route]
layers=-1,-3

#251
#layer4-low2
#fire_module_1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#252
#conv_1*1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#253
[route]
layers=-2

#254
#conv_3*3
[convolutional]
batch_normalize=1
groups=256
filters=256
size=3
stride=1
pad=1
activation=relu

#255
[route]
layers=-1,-3

#256
#fire_module_2
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#257
#conv_1*1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#258
[route]
layers=-2

#259
#conv_3*3
[convolutional]
batch_normalize=1
groups=256
filters=256
size=3
stride=1
pad=1
activation=relu

#260
[route]
layers=-1,-3

#261
#fire_module_3
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#262
#conv_1*1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#263
[route]
layers=-2

#264
#conv_3*3
[convolutional]
batch_normalize=1
groups=256
filters=256
size=3
stride=1
pad=1
activation=relu

#265
[route]
layers=-1,-3

#266
#fire_module_4
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#267
#conv_1*1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#268
[route]
layers=-2

#269
#conv_3*3
[convolutional]
batch_normalize=1
groups=256
filters=256
size=3
stride=1
pad=1
activation=relu

#270
[route]
layers=-1,-3

#271
#layer4-low3
#fire_moduel_1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#272
#conv_1*1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#273
[route]
layers=-2

#274
#conv_3*3
[convolutional]
batch_normalize=1
groups=256
filters=256
size=3
stride=1
pad=1
activation=relu

#275
[route]
layers=-1,-3

#276
#fire_moduel_2
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#277
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#278
[route]
layers=-2

#279
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=1
pad=1
activation=relu

#280
[route]
layers=-1,-3

#281
#layer4-up2
#w*h*c=w*2 * h*2 * c/4
[reorg3d]
stride=2
reverse=1

#282
#layer4-merge=up2+up1
[route]
layers=-1,238

#283
#layer3-low3
#fire_moduel_1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#284
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#285
[route]
layers=-2

#286
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=1
pad=1
activation=relu

#287
[route]
layers=-1,-3

#288
#fire_moduel_2
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#289
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#290
[route]
layers=-2

#291
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=1
pad=1
activation=relu

#292
[route]
layers=-1,-3

#293
#layer3-up2
[reorg3d]
stride=2
reverse=1

#294
#layer3-merge=up2+up1
[route]
layers=-1,216

#295
#layer2-low3
#fire_moduel_1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#296
#conv_1*1
[convolutional]
batch_normalize=1
filters=192
size=1
stride=1
pad=1
activation=relu

#297
[route]
layers=-2

#298
#conv_3*3
[convolutional]
batch_normalize=1
groups=192
filters=192
size=3
stride=1
pad=1
activation=relu

#299
[route]
layers=-1,-3

#300
#fire_moduel_2
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#301
#conv_1*1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#302
[route]
layers=-2

#303
#conv_3*3
[convolutional]
batch_normalize=1
groups=128
filters=128
size=3
stride=1
pad=1
activation=relu

#304
[route]
layers=-1,-3

#305
#layer2-up2
[reorg3d]
stride=2
reverse=1

#306
#layer2-merge=up2+up1
[route]
layers=-1,194

#307
#layer1-low3
#fire_moduel_1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#308
#conv_1*1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#309
[route]
layers=-2

#310
#conv_3*3
[convolutional]
batch_normalize=1
groups=128
filters=128
size=3
stride=1
pad=1
activation=relu

#311
[route]
layers=-1,-3

#312
#fire_moduel_2
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#313
#conv_1*1
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=relu

#314
[route]
layers=-2

#315
#conv_3*3
[convolutional]
batch_normalize=1
groups=128
filters=128
size=3
stride=1
pad=1
activation=relu

#316
[route]
layers=-1,-3

#317
#layer1-up2
[reorg3d]
stride=2
reverse=1

#318
#layer1-merge=up2+up1
[route]
layers=-1,172

###############cnvs1#####################

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

###############inters1#####################

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=relu

[shortcut]
from=-2
activation=relu

###############cnvs2#####################

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

###############inters1#####################
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=relu

#####################################################

[convolutional]
batch_normalize=1
filters=128 #256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128 #256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128 #256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=48
activation=linear

[yolo]
mask = 6,7,8,9,10,11
anchors =23, 16,  20, 42,  42, 23,  56, 38,  87, 30,  40, 79,  97, 53,  76,122, 150, 66, 191, 96, 225,130, 319,141
classes=3
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1

[route]
layers = -4

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=48
activation=linear

[yolo]
mask = 0,1,2,3,4,5
anchors = 23, 16,  20, 42,  42, 23,  56, 38,  87, 30,  40, 79,  97, 53,  76,122, 150, 66, 191, 96, 225,130, 319,141
classes=3
num=12
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=0
