[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=64
subdivisions=64
width=1024
height=256
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
burn_in=1000
max_batches = 10000
policy=steps
steps=7000,8000
scales=.1,.1


[convolutional]
batch_normalize=1
filters=64
size=7
stride=2
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky


# Conv 4
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky




### TridentNet - large objects - Start
#1
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky
#2
[convolutional]
dilation=3
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky
#3
[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear
#4
[shortcut]
from=-4
activation=leaky
#5
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky
#6
[convolutional]
dilation=3
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky
#7
[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear
#8
[shortcut]
from=-4
activation=leaky
#9
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky
#10
[convolutional]
dilation=3
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky
#11
[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear
#12
[shortcut]
from=-4
activation=leaky
#13
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky
#14
[convolutional]
dilation=3
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky
#15
[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear
#16
[shortcut]
from=-4
activation=leaky
#17
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky
#18
[convolutional]
dilation=3
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky
#19
[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear
#20
[shortcut]
from=-4
activation=leaky
#21
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky
#22
[convolutional]
dilation=3
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky
#23
[convolutional]
dilation=3
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear
#24
[shortcut]
from=-4
activation=leaky

#25
## Conv 5
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky
#26
[convolutional]
dilation=3
batch_normalize=1
filters=512
size=3
stride=2
pad=1
activation=leaky
#27
[convolutional]
batch_normalize=1
filters=2048
size=1
stride=1
pad=1
activation=linear
#28
[shortcut]
from=-4
activation=leaky
#29
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky
#30
[convolutional]
dilation=3
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky
#31
[convolutional]
batch_normalize=1
filters=2048
size=1
stride=1
pad=1
activation=linear
#32
[shortcut]
from=-4
activation=leaky
#33
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky
#34
[convolutional]
dilation=3
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky
#35
[convolutional]
batch_normalize=1
filters=2048
size=1
stride=1
pad=1
activation=linear
#36
[shortcut]
from=-4
activation=leaky
#37
[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=2048
activation=leaky
#38
[convolutional]
size=1
stride=1
pad=1
filters=32
activation=linear

[yolo]
mask = 8,9,10,11
anchors = 23, 16,  20, 42,  42, 23,  56, 38,  87, 30,  40, 79,  97, 53,  76,122, 150, 66, 191, 96, 225,130, 319,141
classes=3
num=12
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=0

### TridentNet - large objects - End




### TridentNet - medium objects - Start

[route]
layers = 165

[convolutional]
share_index=166
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=167
dilation=2
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=168
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
share_index=170
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=171
dilation=2
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=172
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
share_index=174
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=175
dilation=2
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=176
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
share_index=178
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=179
dilation=2
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=180
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
share_index=182
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=183
dilation=2
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=184
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
share_index=186
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=187
dilation=2
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=188
dilation=2
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky


## Conv 5
[convolutional]
share_index=190
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=191
dilation=2
batch_normalize=1
filters=512
size=3
stride=2
pad=1
activation=leaky

[convolutional]
share_index=192
batch_normalize=1
filters=2048
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
share_index=194
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=195
dilation=2
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=196
batch_normalize=1
filters=2048
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
share_index=198
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=199
dilation=2
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=200
batch_normalize=1
filters=2048
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=1024
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 49

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=32
activation=linear

[yolo]
mask = 4,5,6,7
anchors = 23, 16,  20, 42,  42, 23,  56, 38,  87, 30,  40, 79,  97, 53,  76,122, 150, 66, 191, 96, 225,130, 319,141
classes=3
num=12
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=0

### TridentNet - medium objects - End











### TridentNet - small objects - Start

[route]
layers = 165

[convolutional]
share_index=166
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=167
dilation=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=168
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
share_index=170
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=171
dilation=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=172
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
share_index=174
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=175
dilation=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=176
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
share_index=178
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=179
dilation=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=180
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
share_index=182
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=183
dilation=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=184
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
share_index=186
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=187
dilation=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=188
dilation=1
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky


## Conv 5
[convolutional]
share_index=190
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=191
dilation=1
batch_normalize=1
filters=512
size=3
stride=2
pad=1
activation=leaky

[convolutional]
share_index=192
batch_normalize=1
filters=2048
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
share_index=194
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=195
dilation=1
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=196
batch_normalize=1
filters=2048
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
share_index=198
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

[convolutional]
share_index=199
dilation=1
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[convolutional]
share_index=200
batch_normalize=1
filters=2048
size=1
stride=1
pad=1
activation=linear

[shortcut]
from=-4
activation=leaky

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=512
activation=leaky

[upsample]
stride=4

[route]
layers = -1, 17

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=512
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=32
activation=linear

[yolo]
mask = 0,1,2,3
anchors = 23, 16,  20, 42,  42, 23,  56, 38,  87, 30,  40, 79,  97, 53,  76,122, 150, 66, 191, 96, 225,130, 319,141
classes=3
num=12
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=0

### TridentNet - small objects - End

